/* 包含头文件 ----------------------------------------------------------------*/
#include "bsp_led.h"

/* 私有类型定义 --------------------------------------------------------------*/
/* 私有宏定义 ----------------------------------------------------------------*/
/* 私有变量 ------------------------------------------------------------------*/
/* 扩展变量 ------------------------------------------------------------------*/
/* 私有函数原形 --------------------------------------------------------------*/
/* 函数体 --------------------------------------------------------------------*/

/**
  * 函数功能: 板载LED灯IO引脚初始化.
  * 输入参数: 无
  * 返 回 值: 无
  * 说    明：使用宏定义方法代替具体引脚号，方便程序移植，只要简单修改bsp_led.h
  *           文件相关宏定义就可以方便修改引脚。
  */
void LED_GPIO_Init(void)
{
    /*设置led的端口io为推挽输出*/
    GPIO_Init(LED1_GPIO, (GPIO_Pin_TypeDef)LED1_GPIO_PIN, GPIO_MODE_OUT_PP_LOW_FAST);
}

/**
  * 函数功能: 设置板载LED灯的状态
  * 输入参数: LEDx:其中x可甚至为(1,2,3)用来选择对应的LED灯
  * 输入参数：state:设置LED灯的输出状态。
  *             可选值：LED_OFF：LED灯灭；
  *             可选值：LED_ON： LED灯亮。
  * 返 回 值: 无
  * 说    明：该函数使用类似标准库函数的编程方法，方便理解标准库函数编程思想。
  */
void LEDx_StateSet(uint8_t LEDx,LEDState_TypeDef state)
{
      /* 判断设置的LED灯状态，如果设置为LED灯灭 */
  if(state==LED_OFF)
  {
    if(LEDx & LED1)            
      GPIO_WriteLow(LED1_GPIO,(GPIO_Pin_TypeDef)LED1_GPIO_PIN);/* 设置引脚输出为低电平，此时LED1灭 */  
  }
  else  /* state=LED_ON ：否则，设置LED灯为亮 */
  {
    if(LEDx & LED1)
      GPIO_WriteHigh(LED1_GPIO,(GPIO_Pin_TypeDef)LED1_GPIO_PIN);/* 设置引脚输出为高电平，此时LED1亮 */
  }
}