/* 包含头文件 ----------------------------------------------------------------*/
#include "bsp_uart.h"

/* 私有类型定义 --------------------------------------------------------------*/
/* 私有宏定义 ----------------------------------------------------------------*/


/* 私有变量 ------------------------------------------------------------------*/
/* 扩展变量 ------------------------------------------------------------------*/
/* 私有函数原形 --------------------------------------------------------------*/
/* 函数体 --------------------------------------------------------------------*/

/**
  * 函数功能: 板载串口初始化.
  * 输入参数: 无
  * 返 回 值: 无
  * 说    明：无          
  */
void SerialInit()
{
    UART2_Init((u32)9600,
           UART2_WORDLENGTH_8D, 
           UART2_STOPBITS_1, 
           UART2_PARITY_NO, 
           UART2_SYNCMODE_CLOCK_DISABLE, 
           UART_MODE);
    UART2_ITConfig(UART2_IT_RXNE_OR, ENABLE);
    UART2_Cmd(ENABLE);
}

/**
  * 函数功能: 重定向c库函数printf到USARTx
  * 输入参数: 无
  * 返 回 值: 无
  * 说    明：无
  */
int fputc(int ch, FILE *f)
{

  /* 发送一个字节数据到调试串口 */
  UART2_SendData8((uint8_t) ch);
  while(!UART2_GetFlagStatus(UART2_FLAG_TC));
  return (ch);
}
